import { تاريخ, تسلسل, تسلسلات_تاريخية } from "./أنواع.ts";

export default (تاريخ: تاريخ): تسلسلات_تاريخية => {
  const تسلسلات_تاريخية: تسلسلات_تاريخية = [تاريخ];
  while (
    !تسلسلات_تاريخية[تسلسلات_تاريخية.length - 1].every((رقم) => رقم === 0)
  ) {
    const تسلسلات_الحالي = تسلسلات_تاريخية[تسلسلات_تاريخية.length - 1];
    const تسلسل: تسلسل = [];
    for (
      let فِهرِس = 0;
      فِهرِس < تسلسلات_الحالي.length;
      فِهرِس++
    ) {
      تسلسل.push(تسلسلات_الحالي[فِهرِس + 1] - تسلسلات_الحالي[فِهرِس]);
    }
    تسلسلات_تاريخية.push(تسلسل);
  }
  return تسلسلات_تاريخية;
};
