import { تاريخ, تسلسل, تسلسلات_تاريخية } from "./أنواع.ts";

export default (تاريخ: تاريخ): تسلسلات_تاريخية => {
  const تسلسلات_تاريخية: تسلسلات_تاريخية = [تاريخ];
  while (
    !تسلسلات_تاريخية[تسلسلات_تاريخية.length - 1].every((رقم) => رقم === 0)
  ) {
    const تسلسل_الحالي = تسلسلات_تاريخية[تسلسلات_تاريخية.length - 1];
    const تسلسل: تسلسل = [];
    for (
      let فِهرِس = 1;
      فِهرِس < تسلسل_الحالي.length;
      فِهرِس++
    ) {
      تسلسل.push(تسلسل_الحالي[فِهرِس] - تسلسل_الحالي[فِهرِس - 1]);
    }
    تسلسلات_تاريخية.push(تسلسل);
  }
  return تسلسلات_تاريخية;
};
