import { تسلسلات_تاريخية } from "./أنواع.ts";

export default (تسلسلات_تاريخية: تسلسلات_تاريخية): تسلسلات_تاريخية => {
  const نسخة_تسلسلات_تاريخية = تسلسلات_تاريخية.slice();
  نسخة_تسلسلات_تاريخية[نسخة_تسلسلات_تاريخية.length - 1].push(0);
  for (let فِهرِس = نسخة_تسلسلات_تاريخية.length - 2; فِهرِس >= 0; فِهرِس--) {
    const تسلسل_الحالي = نسخة_تسلسلات_تاريخية[فِهرِس];
    const التسلسل_التالي = نسخة_تسلسلات_تاريخية[فِهرِس + 1];
    تسلسل_الحالي.push(
      تسلسل_الحالي[تسلسل_الحالي.length - 1] +
        التسلسل_التالي[التسلسل_التالي.length - 1],
    );
  }

  return نسخة_تسلسلات_تاريخية;
};
